package bit_operation;

/**
 * Created by mengyue on 2020-03-27.
 */
public class int的范围 {


    /**
     * 已知int是32bit的, 也就是 2^32
     * 最高位我们用来表示正负 我们就剩31位来表示具体的数值了
     * 所以呢 int的最大值 2^31-1
     * 100000....31个0 减1 011111...31个1
     *
     * 正数的范围 00000...001 ~ 011111...31个1 (不包括0)
     *
     * int的 倒数第二小数 -2^31-1
     * 负数的范围 10000...001 ~ 11111....31个1
     *
     *
     * 剩余的数
     *  0000...0000 代表 0
     *  1000...0000 代表最小值 -2147483648
     *
     * 所以
     * 正数有 2^31 -1 个
     * 负数有 2^31 个
     * 0 有一个
     * 加起来 就是2^32个
     *
     *
     * example:
     *
     * 2^3 = 8
     *
     * 正数2^2-1 = 3
     * 负数2^2 = 4
     * 零
     *
     * 0 00 = 0
     * 0 01 = 1
     * 0 10 = 2
     * 0 11 = 3
     *
     * 1 00 = -4
     * 1 01 = -1
     * 1 10 = -2
     * 1 11 = -3
     *
     */

}
