package test.字符串.easy;

/**
 * Created by mengyue on 2019-09-24.
 */
public class 二进制求和_67 {




    /**
     *
     *
     * 给定两个二进制字符串，返回他们的和（用二进制表示）。
     *
     * 输入为非空字符串且只包含数字 1 和 0。
     *
     * 示例 1:
     *
     * 输入: a = "11", b = "1"
     * 输出: "100"
     * 示例 2:
     *
     * 输入: a = "1010", b = "1011"
     * 输出: "10101"
     *
     * 来源：力扣（LeetCode）
     * 链接：https://leetcode-cn.com/problems/add-binary
     * 著作权归领扣网络所有。商业转载请联系官方授权，非商业转载请注明出处。
     *
     *
     *
     */


    /**
     *
     * 思路：
     * 1.首先注意短的字符串需要 我们去补0 才能让字符串相等 我们遍历的时候 i不会有越位的问题
     * 2.设计一个函数 有三个参数 前两个是 两个字符串 i对应位置的数 第三个 是低位进位后的数 返回值是进位后的结果（假设有进位）
     * 3.最后可能要考虑一下 最大位置有进位的情况
     *
     * 10进制最大向上进位 只能是1 其实任何进制最大向上进位都只能是 1 
     *
     *
     */

}
